results/ycsb/4-nodes/6-clients/couchbase2/workloada_couchbase_custom-validation2/results-10.txt
[OVERALL], RunTime(ms), 73536
[OVERALL], Throughput(ops/sec), 1359.8781549173193
[TOTAL_GCS_G1_Young_Generation], Count, 18
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 211
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.2869342906875544
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 18
[TOTAL_GC_TIME], Time(ms), 211
[TOTAL_GC_TIME_%], Time(%), 0.2869342906875544
[READ], Operations, 49879
[READ], AverageLatency(us), 5941.732332244031
[READ], MinLatency(us), 81
[READ], MaxLatency(us), 1000230
[READ], Return=OK, 49879
[READ], 0, 17853.427872860637
[READ], 1000, 6830.9792243767315
[READ], 2000, 7207.403697996919
[READ], 3000, 5413.186851211072
[READ], 4000, 9418.432377049181
[READ], 5000, 5848.811464968153
[READ], 6000, 5720.821965317919
[READ], 7000, 6890.0955137481915
[READ], 8000, 7988.391608391608
[READ], 9000, 6408.843214756258
[READ], 10000, 7285.177177177177
[READ], 11000, 5469.675544794189
[READ], 12000, 6464.36312849162
[READ], 13000, 6767.3615160349855
[READ], 14000, 5327.329706202394
[READ], 15000, 6193.276346604215
[READ], 16000, 5555.852183650616
[READ], 17000, 4643.286278381046
[READ], 18000, 4945.7160775370585
[READ], 19000, 8495.755357142858
[READ], 20000, 7157.913294797688
[READ], 21000, 6022.288335517694
[READ], 22000, 5139.944105691057
[READ], 23000, 4897.028484231943
[READ], 24000, 6139.327201051248
[READ], 25000, 5813.680592991914
[READ], 26000, 5270.621980676328
[READ], 27000, 6136.906748466257
[READ], 28000, 6515.1933139534885
[READ], 29000, 8439.82384341637
[READ], 30000, 4536.768307322929
[READ], 31000, 5963.812903225807
[READ], 32000, 5511.026602176542
[READ], 33000, 6523.462643678161
[READ], 34000, 6073.9792899408285
[READ], 35000, 7106.863928112965
[READ], 36000, 8355.02487562189
[READ], 37000, 5246.197021764032
[READ], 38000, 5682.740359897172
[READ], 39000, 7901.744514106583
[READ], 40000, 6109.07078313253
[READ], 41000, 4977.426638917794
[READ], 42000, 4503.574612403101
[READ], 43000, 5415.950578338591
[READ], 44000, 5667.50276243094
[READ], 45000, 4087.582781456954
[READ], 46000, 5299.857442348009
[READ], 47000, 5026.731513083049
[READ], 48000, 5375.822246455834
[READ], 49000, 6758.287465940054
[READ], 50000, 7222.634259259259
[READ], 51000, 6937.2342767295595
[READ], 52000, 6730.932824427481
[READ], 53000, 6316.822666666667
[READ], 54000, 6532.519948519948
[READ], 55000, 5755.271028037383
[READ], 56000, 7232.3510140405615
[READ], 57000, 5137.773349937734
[READ], 58000, 5514.0
[READ], 59000, 5169.205333333333
[READ], 60000, 4935.913793103448
[READ], 61000, 5593.689908256881
[READ], 62000, 3424.1797323135756
[READ], 63000, 2887.9895833333335
[READ], 64000, 7555.209302325581
[READ], 65000, 5371.5989010989015
[READ], 66000, 2744.6178571428572
[READ], 67000, 3489.147169811321
[READ], 68000, 1968.7540983606557
[READ], 69000, 1387.6019417475727
[READ], 70000, 2497.1923076923076
[CLEANUP], Operations, 10
[CLEANUP], AverageLatency(us), 3.1
[CLEANUP], MinLatency(us), 0
[CLEANUP], MaxLatency(us), 11
[CLEANUP], 0, 10.0
[CLEANUP], 1000, 4.0
[CLEANUP], 5000, 1.0
[CLEANUP], 6000, 4.0
[CLEANUP], 7000, 1.0
[CLEANUP], 12000, 1.0
[CLEANUP], 14000, 1.0
[UPDATE], Operations, 50121
[UPDATE], AverageLatency(us), 6625.622453662138
[UPDATE], MinLatency(us), 112
[UPDATE], MaxLatency(us), 973996
[UPDATE], Return=OK, 50121
[UPDATE], 0, 25608.762068965516
[UPDATE], 1000, 7304.341498559078
[UPDATE], 2000, 8094.2791411042945
[UPDATE], 3000, 6028.284360189574
[UPDATE], 4000, 9926.148214285715
[UPDATE], 5000, 6514.434405940594
[UPDATE], 6000, 6505.133928571428
[UPDATE], 7000, 6608.214375788146
[UPDATE], 8000, 9303.646428571428
[UPDATE], 9000, 6459.417582417583
[UPDATE], 10000, 8306.5248
[UPDATE], 11000, 6549.207524271845
[UPDATE], 12000, 6729.541666666667
[UPDATE], 13000, 7728.180790960452
[UPDATE], 14000, 5531.484656084656
[UPDATE], 15000, 5602.830188679245
[UPDATE], 16000, 5221.792492179354
[UPDATE], 17000, 5156.3356997971605
[UPDATE], 18000, 6672.358913813459
[UPDATE], 19000, 8321.928024502296
[UPDATE], 20000, 7142.25693430657
[UPDATE], 21000, 6590.188118811881
[UPDATE], 22000, 5306.748733535967
[UPDATE], 23000, 4996.642642642642
[UPDATE], 24000, 6921.386486486486
[UPDATE], 25000, 6963.840243902439
[UPDATE], 26000, 6309.624270711785
[UPDATE], 27000, 6158.954332552693
[UPDATE], 28000, 8530.1327014218
[UPDATE], 29000, 7928.051546391753
[UPDATE], 30000, 6626.160621761658
[UPDATE], 31000, 8788.116136919316
[UPDATE], 32000, 6892.130982367758
[UPDATE], 33000, 6995.58231292517
[UPDATE], 34000, 7602.2412342215985
[UPDATE], 35000, 5890.578064516129
[UPDATE], 36000, 9402.050847457627
[UPDATE], 37000, 6028.087899543379
[UPDATE], 38000, 7282.029374201788
[UPDATE], 39000, 8149.9010067114095
[UPDATE], 40000, 7053.285359801489
[UPDATE], 41000, 7323.306864064603
[UPDATE], 42000, 4831.158267020336
[UPDATE], 43000, 5171.941727367325
[UPDATE], 44000, 5587.678251121076
[UPDATE], 45000, 4833.348345588235
[UPDATE], 46000, 5093.791133004926
[UPDATE], 47000, 6255.08793686584
[UPDATE], 48000, 5455.766917293233
[UPDATE], 49000, 7249.258620689655
[UPDATE], 50000, 7524.154191616766
[UPDATE], 51000, 8095.115714285715
[UPDATE], 52000, 9227.395833333334
[UPDATE], 53000, 7554.020188425303
[UPDATE], 54000, 7013.184549356223
[UPDATE], 55000, 6799.427490542244
[UPDATE], 56000, 6482.128318584071
[UPDATE], 57000, 6129.800539083558
[UPDATE], 58000, 6236.95166163142
[UPDATE], 59000, 4713.9106918238995
[UPDATE], 60000, 7571.621848739495
[UPDATE], 61000, 6462.753649635037
[UPDATE], 62000, 4391.503663003663
[UPDATE], 63000, 3743.928125
[UPDATE], 64000, 7563.46511627907
[UPDATE], 65000, 9849.97247706422
[UPDATE], 66000, 3653.0254777070063
[UPDATE], 67000, 4357.150735294118
[UPDATE], 68000, 2593.024096385542
[UPDATE], 69000, 1860.4061433447098
[UPDATE], 70000, 2107.878205128205