results/ycsb/4-nodes/6-clients/couchbase2/workloada_couchbase_custom-validation2/results-100.txt
[OVERALL], RunTime(ms), 44792
[OVERALL], Throughput(ops/sec), 2232.54152527237
[TOTAL_GCS_G1_Young_Generation], Count, 24
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 614
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 1.3707804965172352
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 24
[TOTAL_GC_TIME], Time(ms), 614
[TOTAL_GC_TIME_%], Time(%), 1.3707804965172352
[READ], Operations, 49847
[READ], AverageLatency(us), 32957.32828455073
[READ], MinLatency(us), 88
[READ], MaxLatency(us), 3893934
[READ], Return=OK, 49847
[READ], 0, 279239.89103690686
[READ], 1000, 34588.91897366644
[READ], 2000, 29664.290485192185
[READ], 3000, 33140.589759407776
[READ], 4000, 29710.111647555823
[READ], 5000, 38432.970409711685
[READ], 6000, 27979.673963133642
[READ], 7000, 28994.77771525042
[READ], 8000, 36351.922352941176
[READ], 9000, 37048.63240810203
[READ], 10000, 42969.495719178085
[READ], 11000, 38086.055555555555
[READ], 12000, 30506.147239263802
[READ], 13000, 35718.35192837466
[READ], 14000, 25722.28659160696
[READ], 15000, 29832.68469015796
[READ], 16000, 29976.48551153164
[READ], 17000, 46136.77392889699
[READ], 18000, 36494.46713286713
[READ], 19000, 24370.25122910521
[READ], 20000, 35819.64220877458
[READ], 21000, 33974.24142757173
[READ], 22000, 28624.19084507042
[READ], 23000, 19585.016759776536
[READ], 24000, 32883.923582089556
[READ], 25000, 27917.92445774121
[READ], 26000, 33339.54567901234
[READ], 27000, 39147.83199195171
[READ], 28000, 33076.51309846432
[READ], 29000, 26702.527161438407
[READ], 30000, 25035.997658079625
[READ], 31000, 21263.64040846098
[READ], 32000, 13172.973514211886
[READ], 33000, 15956.321222130471
[READ], 34000, 8731.565995525727
[READ], 35000, 39788.19672131148
[READ], 36000, 5775.213250517599
[CLEANUP], Operations, 100
[CLEANUP], AverageLatency(us), 0.28
[CLEANUP], MinLatency(us), 0
[CLEANUP], MaxLatency(us), 4
[CLEANUP], 0, 1.25
[CLEANUP], 1000, 1.0
[CLEANUP], 2000, 0.3333333333333333
[CLEANUP], 4000, 0.2
[CLEANUP], 5000, 0.4
[CLEANUP], 6000, 0.8
[CLEANUP], 7000, 0.5
[CLEANUP], 8000, 0.75
[CLEANUP], 9000, 0.0
[CLEANUP], 10000, 0.6666666666666666
[CLEANUP], 11000, 0.1111111111111111
[CLEANUP], 12000, 0.2727272727272727
[CLEANUP], 13000, 0.0
[CLEANUP], 14000, 0.14285714285714285
[CLEANUP], 15000, 0.0
[CLEANUP], 16000, 0.14285714285714285
[CLEANUP], 17000, 0.0
[UPDATE], Operations, 50152
[UPDATE], AverageLatency(us), 33836.14904689743
[UPDATE], MinLatency(us), 114
[UPDATE], MaxLatency(us), 4091121
[UPDATE], Return=OK, 50153
[UPDATE], 0, 363920.32194244605
[UPDATE], 1000, 32450.042310275352
[UPDATE], 2000, 31156.813186813186
[UPDATE], 3000, 31039.44863861386
[UPDATE], 4000, 30342.387941534715
[UPDATE], 5000, 34127.168555240794
[UPDATE], 6000, 29097.243697478993
[UPDATE], 7000, 28130.299544419133
[UPDATE], 8000, 40140.342245989305
[UPDATE], 9000, 37180.798972854
[UPDATE], 10000, 40695.76437246964
[UPDATE], 11000, 43171.77493606138
[UPDATE], 12000, 30899.416466346152
[UPDATE], 13000, 37675.28687315634
[UPDATE], 14000, 25500.829346092505
[UPDATE], 15000, 27992.177185871453
[UPDATE], 16000, 31216.877976190477
[UPDATE], 17000, 40284.021316033366
[UPDATE], 18000, 37597.821556031406
[UPDATE], 19000, 25768.130696044067
[UPDATE], 20000, 35162.25129342203
[UPDATE], 21000, 33855.481635481636
[UPDATE], 22000, 30011.760159893405
[UPDATE], 23000, 20687.273739742086
[UPDATE], 24000, 37666.63372781065
[UPDATE], 25000, 27939.79254930606
[UPDATE], 26000, 33826.2718367347
[UPDATE], 27000, 36790.22318526544
[UPDATE], 28000, 33262.18017241379
[UPDATE], 29000, 25353.171105730427
[UPDATE], 30000, 23312.199838839646
[UPDATE], 31000, 21838.5
[UPDATE], 32000, 14377.750315258512
[UPDATE], 33000, 14452.210063897764
[UPDATE], 34000, 8114.098623853211
[UPDATE], 35000, 31613.22361809045
[UPDATE], 36000, 6221.403846153846