results/ycsb/4-nodes/6-clients/couchbase2/workloada_couchbase_custom-validation2/results-120.txt
[OVERALL], RunTime(ms), 42643
[OVERALL], Throughput(ops/sec), 2345.050770349178
[TOTAL_GCS_G1_Young_Generation], Count, 18
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 598
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 1.4023403606688085
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 18
[TOTAL_GC_TIME], Time(ms), 598
[TOTAL_GC_TIME_%], Time(%), 1.4023403606688085
[READ], Operations, 49891
[READ], AverageLatency(us), 37803.70750235514
[READ], MinLatency(us), 89
[READ], MaxLatency(us), 4754653
[READ], Return=OK, 49891
[READ], 0, 357041.3921302578
[READ], 1000, 39180.47664835165
[READ], 2000, 41968.25567010309
[READ], 3000, 41644.617797228304
[READ], 4000, 39506.11204481793
[READ], 5000, 33419.05053946621
[READ], 6000, 38145.2680878553
[READ], 7000, 35703.74954517889
[READ], 8000, 32538.614464099897
[READ], 9000, 36677.15957446808
[READ], 10000, 20893.608465608464
[READ], 11000, 44383.12197530864
[READ], 12000, 37074.02384020619
[READ], 13000, 31972.79052924791
[READ], 14000, 26527.961174242424
[READ], 15000, 32227.470650449497
[READ], 16000, 28655.198533007337
[READ], 17000, 40657.9002050581
[READ], 18000, 29137.61894393032
[READ], 19000, 37422.97196870926
[READ], 20000, 28104.498672331385
[READ], 21000, 35659.223913043475
[READ], 22000, 41718.53925798102
[READ], 23000, 33824.280728376325
[READ], 24000, 24406.46695095949
[READ], 25000, 28899.181297709925
[READ], 26000, 30147.875952875955
[READ], 27000, 39441.17985611511
[READ], 28000, 36816.23326771653
[READ], 29000, 35928.862183020945
[READ], 30000, 24344.00804828974
[READ], 31000, 19586.746987951807
[READ], 32000, 18299.888732394367
[READ], 33000, 10013.37636761488
[READ], 34000, 1462.8
[CLEANUP], Operations, 120
[CLEANUP], AverageLatency(us), 0.575
[CLEANUP], MinLatency(us), 0
[CLEANUP], MaxLatency(us), 4
[CLEANUP], 0, 1.0
[CLEANUP], 2000, 0.5
[CLEANUP], 3000, 0.3333333333333333
[CLEANUP], 4000, 0.42857142857142855
[CLEANUP], 5000, 0.75
[CLEANUP], 6000, 0.5
[CLEANUP], 7000, 1.0
[CLEANUP], 9000, 1.0
[CLEANUP], 10000, 1.0
[CLEANUP], 11000, 1.0
[CLEANUP], 12000, 0.8181818181818182
[CLEANUP], 13000, 0.5833333333333334
[CLEANUP], 14000, 0.5
[CLEANUP], 15000, 0.6
[CLEANUP], 16000, 0.4166666666666667
[CLEANUP], 17000, 0.35294117647058826
[CLEANUP], 18000, 0.4444444444444444
[UPDATE], Operations, 50109
[UPDATE], AverageLatency(us), 38243.723861980885
[UPDATE], MinLatency(us), 114
[UPDATE], MaxLatency(us), 4588558
[UPDATE], Return=OK, 50109
[UPDATE], 0, 322933.99185888737
[UPDATE], 1000, 39737.224764468374
[UPDATE], 2000, 43943.01064584812
[UPDATE], 3000, 43099.1709039548
[UPDATE], 4000, 44147.343516632725
[UPDATE], 5000, 34033.78490990991
[UPDATE], 6000, 36696.58740790355
[UPDATE], 7000, 36666.56242274413
[UPDATE], 8000, 34155.632558139536
[UPDATE], 9000, 37998.034505208336
[UPDATE], 10000, 21491.554612937434
[UPDATE], 11000, 38713.38399189463
[UPDATE], 12000, 40011.71321227301
[UPDATE], 13000, 34021.587611607145
[UPDATE], 14000, 29016.19934640523
[UPDATE], 15000, 31901.705486542443
[UPDATE], 16000, 27656.872876994337
[UPDATE], 17000, 45350.75705437027
[UPDATE], 18000, 33332.89002145923
[UPDATE], 19000, 36450.07230471272
[UPDATE], 20000, 27587.881024096387
[UPDATE], 21000, 31575.786508524834
[UPDATE], 22000, 46296.69169329073
[UPDATE], 23000, 33600.09616829451
[UPDATE], 24000, 30261.337256908904
[UPDATE], 25000, 30715.639498432603
[UPDATE], 26000, 32802.828260869566
[UPDATE], 27000, 39869.915270018624
[UPDATE], 28000, 34507.29675572519
[UPDATE], 29000, 35450.42872340426
[UPDATE], 30000, 26209.975708502025
[UPDATE], 31000, 18676.664136622392
[UPDATE], 32000, 18420.338616714696
[UPDATE], 33000, 9434.890410958904
[UPDATE], 34000, 5979.222222222223